<a href="https://colab.research.google.com/github/IucasDev/IucasDeve/blob/main/Aula_20_21_22_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/cadastro_clientes.csv')

In [ ]:
#Agrupando valor com coluna
# sum= para somar valores
df.groupby('Estado')["Gasto_Total"].sum()

Estado
AP     8760.77
CE     4400.47
ES    13544.87
MG    14127.35
PE     8274.18
PI     9976.92
PR    19757.81
RJ     7180.85
RN    10671.17
RO     7063.04
RR    12738.02
SE     7785.77
TO     4779.47
Name: Gasto_Total, dtype: float64

In [ ]:
# Agrupar e calcular o valor m√©dio

df.groupby('Sexo')["Idade"].mean()

Sexo
Feminino     42.625000
Masculino    45.583333
Name: Idade, dtype: float64

In [ ]:
# contagem de registros por (Linhas existem por Estado)
df.groupby('Estado')["ID_Cliente"].count()

Estado
AP    1
CE    1
ES    2
MG    2
PE    1
PI    1
PR    3
RJ    1
RN    2
RO    1
RR    2
SE    2
TO    1
Name: ID_Cliente, dtype: int64